var addressPoints = [
  [
    "Asilomar CA, USA",
    36.626339,
    -121.935219
  ],
  [
    "Uppsala, Sweden",
    59.858131,
    17.644621
  ],
  [
    "Lund, Sweden",
    55.702888,
    13.194710
  ],
  [
    "Helsinki, Finland",
    60.169857,
    24.938379
  ],
  [
    "Manchester NH, USA",
    42.990929,
    -71.463089
  ],
  [
    "Aarhus, Denmark",
    56.162321082166336, 
    10.209427536399241
  ],
  [
    "New Brunswick, NJ, USA",
    40.48471404848701, 
    -74.42517608423867
  ],
  [
    "New Orleans, LA, USA",
    29.949326721555575, 
    -90.06116927247963
  ],
  [
    "Baltimore MD, USA",
   39.2920304535321, 
   -76.63356048907963
  ],
   [
    "Puerto Varas, Chile",
   -41.31721393527429, 
   -72.9864244854031
  ],
  [
    "Concepción, Chile",
  -36.82017943918894, 
  -73.0502365770559
  ]
];